Repository: nuestrojardinacademy/nuestrojardinacademy.github.io
Catalog: _i18n/*/*.po
Languages: es

source: $11-$17 per hour depending on education and work experience
es: $11-$17 por hora dependiendo del nivel de educación y experiencia previa

source: ** Extended care until 5 pm available upon request for an extra $25 fee for the entire week ($20 for the week of July 3-7)
es: ** Ofrecemos jornada prolongada disponible con previa solicitud. $25 por semana.

source: 1 observed holiday in the summer
es: 1 día feriado durante el verano

source: 1 week off in Spring
es: 1 semana libre durante la primavera

source: 1st Wednesday of each month
es: Primer miércoles de cada mes

source: 2 days (T,Th)
es: 2 días (Ma,J)

source: 2 weeks off in December
es: 2 semanas libres en diciembre

source: 2nd Wednesday of every other month
es: El segundo miércoles (cada dos meses)

source: 3 days (M, W, F)
es: 3 días (L, Mi, V)

source: 3-4 year olds
es: 3-4 años

source: 3rd Wednesday of each month
es: Tercer miércoles de cada mes

source: 4 days (M-Th/T-F)
es: 4 días (L-J/Ma-V)

source: 4 days of professional development/planning days before the school year begins
es: 4 días de desarrollo profesional/planeamiento antes de comenzar el año escolar

source: 4 weeks off during the summer.
es: 4 semanas libres durante el verano

source: 4-5 year-olds
es: 4-5 años

source: 5 days
es: 5 días

source: 5 days of professional development/planning days throughout the school year
es: 5 días de desarrollo profesional/planeamiento durante el año escolar

source: 5% credit given if more than one child is enrolled during the same school year.
es: Se le dará 5% de descuento a cualquier hermano o hermana de otro u otra que ya esté matriculado durante ese mismo año escolar.

source: 5% credit given if tuition is paid in full prior to September 1.
es: Se le dará 5% de descuento si paga la colegiatura del año completo antes del 1 de septiembre.

source: 6-7 year-olds
es: 6-7 años

source: 7 weeks off in a year
es: 7 semanas libres durante el año

source: 8 observed holidays during the school year
es: 8 días feriados durante el año escolar

source: 90:10 Immersion Model
es: Modelo de Inmersión 90:10

source: <a href="camps" style="color:white">Summer, Summer, Summer Camps!</a>
es: <a href="camps" style="color:white">¡Campamentos de Verano!</a>

source: <span class="nja-green">Summer</span> Camps
es: Campamentos de <span class="nja-green">Verano</span>

source: <span class="nja-green">Events</span> at Nuestro Jardín
es: <span class="nja-green">Otros Eventos</span> en Nuestro Jardín

source: <span class="nja-green">Open</span> Houses
es: <span class="nja-green">Puertas</span> Abiertas

source: <span class="nja-green">Our</span> Philosophy
es: <span class="nja-green">Nuestra</span> Filosofía

source: A minimum of one year commitment is required. Both part-time and full-time new hires will be working under a contract.
es: Se pide un compromiso mínimo de un año. Todo empleado, ya sea de tiempo completo o medio tiempo, estará bajo contrato.

source: AA Degree in early childhood education, elementary education, child development, or special education OR
es: Titulado con un AA en educación de la primera infancia, educación primaria, desarrollo infantil o educación especial/diferencial. O

source: ADDITIONAL EXPECTATIONS:
es: EXPECTATIVAS ADICIONALES:

source: Adhere to personnel policies as outlined in the Employee Handbook.
es: Adherirse a las normas de personal estipuladas en el Manual del Empleado.

source: Advance Tuition Discount:
es: Descuento por Pago Anual:

source: After 90 days of full-time employment (34+ hours a week):
es: Después de 90 días de empleo por tiempo completo (34+ horas por semana):

source: And dads could not be forgotten! They, too, will get some ‘me time’ with other Nuestro Jardín’s dads. Similarly to MNO, dads will decide on the events for each month at the beginning of each school year (dinner, movie, working out, book club, game night, etc.)
es: ¡Y no nos podríamos olvidar de los papás! Ellos, también, tendrán tiempo para ellos y podrán realizar actividades con otros padres de Nuestro Jardín. Tal como en el grupo NPM, los padres decidirán en los eventos a realizar cada mes al comienzo de cada año escolar (cena, película, hacer ejercicio, club de lectura, noche de juegos de mesa, etc.)

source: Applicant must be bilingual AND be a native Spanish speaker or have native-like fluency/proficiency
es: Los postulantes deben ser bilingües; ADEMÁS deben ser hablantes nativos del español o deben tener la fluidez y dominio del idioma como un hispanohablante “nativo”.

source: Apply
es: Postulación

source: Apply Online
es: Postule En Línea

source: Arrive to work on time; punctually attend and actively participate in all required activities, meetings, and trainings.
es: Llegar a tiempo al trabajo; asistir puntualmente y participar activament en todas la actividades, reuniones y entrenamientos que sean requeridos.

source: Arts & Craft <span style="font-size:10px;">(by Giulian Frisoni)</span>
es: Artes & Manualidades <span style="font-size:10px;”>(por Giulian Frisoni)</span>

source: Assist in creating, revising, and implementing lesson plans based on our Spanish immersion program’s goals and objectives.
es: Ayudar en la creación, revisión e implementación de planes de estudio basados en las metas y los objetivos de nuestro programa de inmersión en español.

source: Assist in designing and maintaining a warm, nurturing, enriched, and challenging learning environment.
es: Ayudar en el diseño y la mantención de un ambiente de aprendizaje acogedor, de cariño, enriquecido y desafiante.

source: Assist in the maintenance of a safe, healthy, and orderly classroom environment.
es: Ayudar en la mantención de un ambiente sano, seguro y de orden en el salón de clase.

source: At Nuestro Jardín Academy:
es: En Nuestro Jardín Academy:

source: At Nuestro Jardín, we believe in the importance of raising cultural awareness in students, teaching diversity, and growing responsible global citizens. We help children understand, embrace, and respect differences and similarities among those in our community. To this end, we integrate culturally-rich activities in our every-day curriculum, and two Fridays per month, we celebrate Día del Patrimonio (Cultural Heritage Day) by immersing ourselves in a culture from a country or region around the world.
es: En Nuestro Jardín, creemos en la importancia de fomentar la conciencia cultural en los niños, de enseñar el concepto de diversidad y de crear ciudadanos globales responsables. Ayudamos a lo niños a entender, aceptar y respetar las diferencias y similitudes entre todos en nuestra comunidad. Con este propósito, integramos en nuestro currículo actividades que sean culturalmente ricas y durante dos viernes por mes, celebramos el Día del Patrimonio (Cultural Heritage Day). Ese día, nos sumergimos completamente en una cultura de un país o región del mundo.

source: At least two years of experience working with young children and families in a daycare/ preschool program. OR
es: Por lo menos dos años de experiencia trabajando con niños pequeños y familias en programas de cuidado para niños o centros preescolares. O

source: Be a respectful, cooperative, and reliable team member and participant in program activities.
es: Ser un integrante de equipo respetuoso, cooperador y fiable y ser partícipe en las actividades programáticas de nuestra escuela.

source: Be able to read, speak, and write with native-like fluency and proficiency in Spanish.
es: Tener la habilidad de leer, hablar y escribir con fluidez similar a la de un hispanohablante “nativo”.

source: Be available to substitute for other classes as needed.
es: Estar disponible para ser suplente en otras clases cuando sea necesario.

source: Be familiar with, and adhere to, position-related policies and procedures as well as the program’s overarching objectives.
es: Familiarizarse con y adherirse a las normas y procedimientos relacionados con su puesto, al igual que con los objetivos principales de nuestro programa.

source: Be responsible and oversee the accomplishment of routine tasks with regard to the health, safety, and well-being of children, and maintain the program in accordance with the requirements of the Oregon Child Care Division.
es: Ser responsable y supervisar la realización de las tareas rutinarias/cotidianas en lo que se refiere a la seguridad, salud y bienestar de los niños y ayudar a mantener el programa conforme a los requisitos establecidos por el Oregon Child Care Division.

source: CALENDAR INFORMATION:
es: INFORMACIÓN DEL CALENDARIO:

source: CENTRALLY LOCATED
es: CENTRALMENTE UBICADA

source: COMPENSATION & BENEFITS:
es: REMUNERACIÓN Y BENEFICIOS:

source: CONTACT:
es: INFORMACIÓN DE CONTACTO:

source: Camps
es: Campamentos

source: Ceramics in Mexico date back thousands of years before the Pre-Columbian period, when ceramic arts and pottery crafts developed with the first advanced civilizations and cultures of Mesoamerica. With one exception, pre-Hispanic wares were not glazed, but rather burnished and painted with colored fine clay slips. The potter's wheel was unknown as well; pieces were shaped by molding, coiling and other methods.
es: La cerámica en México data desde hace miles de años antes del periodo precolombino, cuando al arte de la cerámica y la alfarería se desarrollaron con las primeras civilizaciones avanzadas y las culturas de Mesoamérica. Con una excepción, la terracota prehispánica no era vidriada, sino más bien bruñida y pintada con la técnica de engobe, usando arcilla fina de colores. Aún no existía el torno de alfarero, en vez, las piezas eran enrolladas, modeladas y moldeadas.

source: Children actively participate in classroom activities.
es: Los niños participan activamente en la clase.

source: Children are <strong>engaged</strong> with stories about local customs, dances, songs and art.
es: Planificamos actividades para los niños <strong> centradas </strong> en costumbres, bailes, canciones y arte de los países hispanohablantes.

source: Children benefit from our well thought-out, research-based, integrated, and multi-culturally rich program.
es: Los niños se benefician de nuestro programa bien planteado, basado en investigaciones, integrado y multi-cultural.

source: Children bring a lunch from home. We encourage parents to prepare healthy lunches that best meet their children’s unique dietary needs.
es: Cada niño trae almuerzo de su casa. Animamos a los padres a prepararles a sus hijos un almuerzo saludable que cumpla con sus necesidades dietéticas.

source: Claudia Contreras-Peters was born and raised in Santiago, Chile, and at an early age, she was interested in (or obsessed with) languages. In 1992, she took a trip to California to “visit her aunt and practice her English.” She made a decision to stay in the United States and attend college in California. But that trip became the trip of her life, in that those 3 months became 24 years!
es: Claudia Contreras-Peters nació y se crió en Santiago de Chile. A una temprana edad, comenzó su obsesión con los idiomas. En 1992, hizo un viaje a California para “visitar a su tía y practicar el inglés que había aprendido.” Durante ese viaje, tomó la decisión de quedarse en los Estados Unidos para seguir sus estudios universitarios en California. Sin embargo, se convirtió en el viaje de su vida, ya que esos 3 meses se convirtieron en 24 años.

source: Claudia comes from a family of educators who are passionate about teaching, guiding, and supporting children in whatever stage of life they are in. Claudia has been teaching for over 15 years, 7 of which were in a Spanish immersion program for the San José Unified School District in San Jose, California. During her time there, she was able to have first-hand experience and was able to see the benefits bilingual immersion programs can offer.
es: Ella proviene de una familia de educadores que sienten una gran pasión por educar, formar y guiar a los niños, en cualquier etapa de vida que se encuentren. Ha enseñado por más de 15 años, 7 de los cuales fueron en un programa de doble inmersión en el Distrito Unificado de San José en California. Esa experiencia personal le ayudó a ver los beneficios que pueden ofrecer los programas bilingües de inmersión.

source: Claudia has been working for over a year to make Nuestro Jardín Academy a reality. She saw the need for high quality Spanish immersion preschools in Portland and wanted to provide parents with the opportunity to give their children the gift of a second language. In the years she worked with college-aged students, she really missed working with children and their sense of wonder, their creativity, and sense of adventure. She is very excited to embark on this new journey, where she can combine her passion for teaching children, her love of languages, and her deep belief of supporting and mentoring other teachers.
es: Ya hace más de un año que Claudia ha estado trabajando en el proyecto de Nuestro Jardín Academy. Al ver la necesidad y la demanda que tienen los programas bilingües en Portland, ella quiere facilitarles a los padres el darles a sus hijos el regalo de un segundo idioma. En los años que trabajó con estudiantes universitarios, ella extrañó su labor de docente con niños por el innato sentido del asombro que tienen, su creatividad y necesidad de aventura. Está muy feliz de embarcarse en este nuevo proyecto, en donde puede combinar su pasión por educar, formar, enseñar, su amor por los idiomas y su gran convicción de apoyar y guiar a otros maestros.

source: Claudia lives in NE Portland with her husband, two sons (one in kindergarten, the other in preschool), and cat, Cuchito.
es: Claudia vive en el noreste de Portland con su esposo, sus dos hijos (uno en kínder y el otro de edad preescolar) y su gato, Cuchito.

source: Commitment:
es: Compromiso:

source: Community Night
es: Noche de la Comunidad

source: Completion of 20 semester credits or 30 quarter credits of training at a college or university in Early childhood education, child development, elementary education, or special education AND at least one year of experience working with young children and families in a daycare/preschool program.
es: 20 créditos de semestre o 30 de trimestre de entrenamiento en una escuela superior o universidad en educación de la primera infancia, educación primaria, desarrollo infantil o educación especial/diferencial. Y por lo menos un año de experiencia trabajando con niños pequeños y familias en programas de cuidado para niños o centros preescolares.

source: Confidentiality:
es: Confidencialidad:

source: Continue reading %s <span class="meta-nav">&rarr;</span>
es: Continuar leyendo %s <span class="meta-nav">&rarr;</span>

source: Create and manage a warm and challenging learning environment for students, incorporating appropriate activities which meet the needs of the group as well as those of individual children and families.
es: Crear y manejar un ambiente de aprendizaje acogedor y desafiante para los estudiantes, incorporando actividades apropiadas y atendiendo a las necesidades de la clase, de cada niño, y de cada familia.

source: Current First Aid/CPR card
es: Tarjeta de Primeros Auxilios/RCP

source: Dad’s Night Out (DNO)
es: Noche para Papá (NPP)

source: Daily Schedule
es: Horario Diario

source: Day of the Dead
es: Día de los Muertos

source: Deposit and Fees:
es: Depósitos y Cargos:

source: Detailed class descriptions
es: Descripción detallada de clases

source: Director
es: Directora

source: Dismissal (3:00-5:00)
es: Despedida (3:00-5:00)

source: During her years at San José Unified School District, Claudia worked under the supervision of <a href="http://atdle.org/about-us/meet-the-team/" target="_blank">Dr. Rosa Molina</a> a renowned bilingual and bilingual immersion advocate. Claudia worked at a Professional Development school where she grew fond of collaboration and professional development practices to further her growth as an educator. As a linguist, second language teacher, and second language learner herself, Claudia has a deep understanding of first and second language acquisition and learning.
es: Durante su práctica como maestra en el Distrito Unificado de San José, trabajó bajo la supervisión de la <a href="http://atdle.org/about-us/meet-the-team/" target="_blank">Dra. Rosa Molina</a> una reconocida defensora y experta en el campo del bilingüismo y de los programas de inmersión. Además cooperó en una escuela de Desarrollo Profesional en donde comenzó a interesarse en la colaboración y en las prácticas de desarrollo profesional para fortalecer su praxis como educadora. Como lingüista, profesora de segundo idioma y aprendiz de un segundo idioma, Claudia tiene una fundación sólida en el ámbito de la adquisición y aprendizaje de la primera y segunda lengua.

source: ESSENTIAL FUNCTIONS:
es: FUNCIONES ESENCIALES:

source: Education researcher, Neville V. Scarfe said, “play is the highest form of research”. Children learn best when given adequate time to move their bodies. At Nuestro Jardín Academy, we strongly believe that a great deal of learning is happening during unstructured play time, and that there is a lot of value in it.
es: Como Neville V. Scarfe dijo, “el juego es el mejor tipo de investigación,” nosotros, en Nuestro Jardín Academy, creemos firmemente de que el niño aprende mucho durante el juego no estructurado y de que hay valor en ello. Además, los niños adquieren un aprendizaje significativo cuando tienen un tiempo adecuado para interactuar con sus pares. Por esta razón una gran parte del tiempo destinado al juego no estructurado ocurre en el patio de recreo.

source: Enhancement Class - Mixed-Age Groups
es: Clases de Enriquecimiento- Grupos de Edades Mixtas

source: Enrollment
es: Admisión

source: Enrollment & <span class="nja-green">Tuition</span>
es: Inscripciones & <span class="nja-green">Matrícula</span>

source: Enrollment in Oregon Central Background Registry (can be done right after accepting employment)
es: Registro en el Oregon Central Background Registry (esto puede ocurrir después de aceptar empleo)

source: Español
es: English

source: Everyone strives to build a community, involving students, teachers, and parents.
es: Todos nos esforzamos por formar una comunidad en la cual nuestros estudiantes, maestros y padres sean partícipes activos y hagan contribuciones positivas a nuestra comunidad.

source: FULL AND PART TIME SPANISH PRESCHOOL TEACHER (NE Portland)
es: MAESTROS PREESCOLARES DE ESPAÑOL - TIEMPO COMPLETO Y MEDIO TIEMPO (NE Portland)

source: Fall Festival (October)
es: Festival del Otoño (octubre)

source: Festivals and Celebrations
es: Festivales y Celebraciones

source: Flamenco Dance
es: Danza flamenca

source: Following our balanced approach, students spend part of the day in same-age groups and the other in mixed-age groups. The following schedule is an example of the daily schedule at Nuestro Jardín, but the order of subjects and activities will vary depending on the group your child is assigned.
es: Siguiendo nuestro enfoque balanceado, agrupamos a los estudiantes de acuerdo a su edad. Ellos pasan parte del día en grupos homogéneos y el resto en grupos heterogéneos. El siguiente horario es un ejemplo de las actividades realizadas en Nuestro Jardín, pero el orden de cada actividad varía dependiendo del grupo que su hijo sea asignado.

source: Food Handlers Card
es: Tarjeta de Manejo de Comida

source: For each camp, children will be divided into 3 age groups of 8-10 children each. While the theme is the same for all groups, activities and instruction will cater to each group's individual needs and language levels.
es: Para cada campamento, dividiremos a los niños de acuerdo a sus edades en 3 grupos de 8 a 10 cada uno. Mientras el tema será el mismo para todos los grupos, las actividades e instrucción atenderán a las necesidades individuales de cada grupo y a los distintos niveles del idioma de cada campista.

source: Fostering <span class="nja-green">Cultural</span> Awareness
es: Fomentando la<span class="nja-green">Conciencia</span> Cultural

source: Founder / Director
es: Fundadora / Directora

source: Free Choice/Play
es: Libre Elección/Juego

source: Frida Kahlo <span style="font-size:10px;">(by Maria de Oro)</span>
es: Frida Kahlo <span style="font-size:10px;”>(por Maria de Oro)</span>

source: Full Day
es: Jornada Completa

source: Full Day: $250 per week ($200 for July 5-8)
es: Jornada Completa: $250 por semana ($200 por la semana del 5-8 julio)

source: Full Day: $275 per week ($220 for July 5-8)
es: Jornada Completa: $275 por semana ($220 por la semana del 5-8 julio)

source: Full Day: 8:30-4:30 **
es: Jornada Completa: 8:30-4:30 **

source: Full-Time: 34-38 hours per week
es: Tiempo Completo: 34-38 horas por semana

source: Full-day - 8:00 am to 5:00 pm
es: Jornada Completa - 8:00 am a 5:00 pm

source: Guelaguetza Celebrations
es: Festival La Guelaguetza

source: Half Day
es: Media Jornada

source: Half Day: $160 per week ($127 for July 5-8)
es: Media Jornada: $160 por semana ($127 por la semana del 5-8 julio)

source: Half Day: $175 per week ($140 for July 5-8)
es: Media Jornada: $175 por semana ($140 por la semana del 5-8 julio)

source: Half Day: 8:30-12:30
es: Media Jornada: 8:30-12:30

source: Half-day - 8:00 am to 12:30 pm
es: Media Jornada - 8:00 am a 12:30 pm

source: Home
es: Inicio

source: Hours of Operation:
es: Horario de Atención:

source: Hours:
es: Jornada:

source: If you talk to a man in a language he understands, <br> that goes to his head. <br> <span class="color-green">If you talk to him in his language,</span> <br>that goes to his heart.
es: Si hablas a un hombre en un lenguaje que comprende, <br> eso llega a su intelecto. <br> <span class="color-green">Si le hablas en su lenguaje, </span> <br>eso llega a su corazón.

source: Interested applicants, please send a cover letter and resume indicating clearly which position you are applying for (P/T or F/T) to Claudia Contreras-Peters, Director, via e-mail at <a href="mailto:nja.claudia@gmail.com">nja.claudia@gmail.com</a> or to:
es: Si está interesado en postular, debe enviar una carta de presentación y currículum, indicando claramente la posición que solicita (tiempo completo o medio tiempo) a Claudia Contreras-Peters, Directora, por e-mail a nja.claudia@gmail.com o a la siguiente dirección:

source: International Festival (February)
es: Festival Internacional (febrero)

source: Interviews will start the week of March 14th, 2016
es: Las entrevistas comenzarán la semana del 14 de marzo, 2016.

source: It is very important to keep us up to date with changes to contact details (such as email address and phone numbers).
es: Por esta razón, es muy importante de que nos ayude a mantener su información de contacto actualizada (como su dirección de correo electrónico y número de teléfono).

source: It's amazing what children can learn if given the opportunity. Without even knowing it, your child can start down the path of bilingualism. They'll thank you later!
es: Es increíble lo que pueden aprender los niños si se les ofrece la oportunidad de hacerlo. Sin saberlo, su hijo o hija podrá iniciar el camino hacia el bilingüismo. ¡Se lo agradecerán más adelante!

source: Job <span class="nja-green">Opportunities</span>
es: <span class="nja-green">Oportunidades</span> de Empleo

source: Job Description:
es: Descripción:

source: Jobs
es: Empleos

source: Kids’ Night Out aka Parents’ Night Out
es: Noche para los Niños conocido como Noche para Padres

source: Language Arts/Social Studies - Whole Group and Free Choice/Play
es: Lenguaje/Estudios Sociales- Instrucción al Grupo Entero y Libre Elección/Juego

source: Last Friday of every month (except for Nov. & Dec.)
es: Último viernes de cada mes (excepto en noviembre & diciembre)

source: Learn More
es: Más Información
