Repository: nuestrojardinacademy/nuestrojardinacademy.github.io
Catalog: _i18n/*/*.po
Languages: es

source: Learning and understanding the <span>culture</span> behind the language can make learning fun. We engage the children with activities centered around customs, dances, songs and art.
es: El poder entender y aprender acerca de la <span> cultura </span> que hay detrás de un idioma hace el aprendizaje más ameno y divertido. Planificamos actividades para los niños centradas en costumbres, bailes, canciones y arte de los países hispanohablantes.

source: Learning and understanding the culture behind the language can make learning <strong>fun.</strong>
es: El poder entender y aprender acerca de la cultura que hay detrás de un idioma hace el aprendizaje más <strong>ameno y divertido.</strong>

source: Lunch (12:30-12:40 - Half Day Dismissal)
es: Almuerzo (12:30-Despedida para los de Media Jornada)

source: Lunch:
es: Almuerzo:

source: MINIMUM QUALIFICATIONS:
es: REQUISITOS MÍNIMOS:

source: Math/Science- Whole Group and Free Choice/Play
es: Matemáticas/Ciencias- Instrucción al Grupo Entero y Libre Elección/Juego

source: Medical benefits
es: Beneficios médicos

source: Mom’s Night Out (MNO)
es: Noche para Mamá (NPM)

source: Monthly Tuition 2017-2018 School Year
es: Colegiatura Mensual Año Escolar 2017-2018

source: Most festivals and celebrations at Nuestro Jardín coincide with the change of seasons. These festivals and celebrations give us all a chance to embrace and learn about each other’s cultures and traditions and customs around the world.
es: La mayoría de los festivales y celebraciones en Nuestro Jardín coinciden con los cambios de estaciones del año. Éstos nos dan la oportunidad de entender y aprender acerca de cada una de nuestras culturas, tradiciones y costumbres alrededor del mundo.

source: Most, if not all, of our Spanish teachers are native Spanish speakers and are the main language model for the students, making sure to speak only in Spanish. During English time, the English teacher will speak in English only.
es: Casi todos, si no todos, nuestros maestros de español son hispanohablantes y actúan como modelos principales del idioma español para los niños, asegurándose de hablar solamente el segundo idioma en la “hora de español”. Durante la”hora de inglés”, los maestros hablarán solamente en inglés.

source: Music is an important part of learning
es: La música es un importante factor en el desarrollo y aprendizaje de los niños

source: Nap/Quiet Time
es: Siesta/Descanso

source: New teachers must satisfactorily complete a training program before summer camp sessions and/or the new school year start.
es: Cualquier docente nuevo que se integre a nuestra escuela debe completar satisfactoriamente una capacitación antes de que comiencen los campamentos de verano y/o el nuevo año escolar.

source: Newly enrolled families- last month’s tuition and a $180.00 one-time registration fee/materials fee (non-refundable).
es: Familias Nuevas- arancel/cuota del último mes y cargo de registro/cargo para materiales de $180.00 (no reembolsable)

source: Nuestro Jardín Academy - Spanish Immersion Preschool | Portland, Oregon
es: Nuestro Jardín Academy - Spanish Immersion Preschool | Portland, Oregón

source: Nuestro Jardín Academy believes in a well-rounded balanced educational approach to early childhood learning. We selected the best of many <a href="http://www.childcarenetworkofevanston.org/site/files/944/111817/381399/522710/Early_Childhood_Progam_Philosophies.pdf">early childhood program philosophies</a>, such as Reggio Emilia, Montessori, Waldorf, and Play Based, and apply them to our teaching practices.
es: Nuestro Jardín Academy promueve un enfoque educacional balanceado en la educación preescolar. Hemos seleccionado los mejores elementos de diversas <a href="http://www.childcarenetworkofevanston.org/site/files/944/111817/381399/522710/Early_Childhood_Progam_Philosophies.pdf">filosofías educativas para la primera infancia</a>, como Reggio Emilia, Montessori, Waldorf y Play Based (Enseñanza Lúdica), y las ponemos en práctica diariamente en el aula.

source: Nuestro Jardín Academy developed its very own curriculum to challenge and inspire preschool-aged children. It strives to balance academics with creative expression and play. Children are exposed to Spanish in the context of learning about relevant daily activities, nature, art, the alphabet, numbers, culture, and more. <span class="more-link">(more)</span>
es: Nuestro Jardín Academy diseñó su propio currículo para desafiar e inspirar a los niños de edad preescolar. Procura ofrecer un balance entre lo académico, la expresión creativa y el juego. El estudiante está expuesto al español en el contexto de aprender acerca de actividades diarias que sean relevantes, de la naturaleza, del arte, del alfabeto, de los números, de la cultura y mucho más. <span class="more-link">(mas)</span>

source: Nuestro Jardín Academy is a new Spanish immersion preschool in Portland, OR, offering a high-quality program that fosters first and second language acquisition.
es: Nuestro Jardín Academy es una escuela de inmersión en español en Portland, OR, que ofrece un programa que fomenta la adquisición del primer y segundo idioma.

source: Nuestro Jardín Academy is a true Spanish immersion preschool, serving children 3 to 5+ years old. We provide a high-quality, research-based program that fosters the acquisition of children's first and second language with a focus on developing the “whole child.”
es: Nuestro Jardín Academy es una escuela de pre-kínder con un verdadero programa de inmersión en español, para niños de 3 a 5 años de edad. Proporcionamos un programa de calidad superior a base de investigación que fomenta la adquisición del primer y segundo idioma en los niños, enfocándonos en desarrollar y educar al niño en su totalidad.

source: Nuestro Jardín Academy mostly follows the Portland Public Schools Calendar:
es: Nuestro Jardín Academy sigue principalmente el calendario de Portland Public Schools:

source: Nuestro Jardín Academy, a brand new Spanish immersion preschool in Portland, Oregon, is seeking full and part time Spanish-speaking preschool teachers to start up in late spring/beginning of summer 2016. Our preschool provides a high-quality, research-based program that fosters the acquisition of children's first and second language with a focus on developing the whole child. We believe in making this a unique language and cultural immersion experience for children, so we are looking for the perfect candidates to join our team. Our goal is for teachers to work in a fun, supportive, and collaborative environment. Teachers are one of the best assets to our program, so providing high-quality professional development in Spanish will help you become the best teacher you can be.
es: Nuestro Jardín Academy, un nuevo centro preescolar de inmersión en español en Portland, Oregón, está buscando maestros de español por tiempo completo y medio tiempo para fines de la primavera/comienzo del verano 2016. Nuestro centro preescolar se caracteriza en proporcionar un programa de alta calidad, a base de investigación, que fomenta la adquisición del primer y segundo idioma, con un enfoque en educar al niño en su totalidad. Hacemos hincapié en hacer de ésta una experiencia cultural única de inmersión al idioma español para los niños en el entorno preescolar, y para esto necesitamos a los perfectos candidatos que deseen unirse a nuestro equipo. Nuestra meta es de que nuestros maestros trabajen en un ambiente que sea divertido, que proporcione apoyo y que sea colaborativo. El docente es una parte vital y de suma importancia en nuestro programa, entonces el poder proporcionarle desarrollo y capacitación personal de alta calidad en español, le ayudará a mejorar sus técnicas educativas y a surgir como maestro.

source: Nuestro Jardín believes in making this a unique language and cultural immersion experience for children in a preschool setting, where students not only get direct exposure to the language but also to the many different Spanish-speaking cultures in a nurturing, challenging, stimulating, and playful environment.
es: Nuestro Jardín hace hincapié en hacer de ésta una experiencia única de inmersión del idioma y cultural para los niños en el entorno preescolar, donde los estudiantes no sólo tienen contacto directo con el idioma, sino también están expuestos a las culturas hispanoamericanas en un clima de cuidado, bienestar, estimulante, desafiante y lúdico.

source: Nurturing the Whole Child
es: Educando al niño en su Totalidad

source: Of course children would love to have some fun while their parents get a child-free night out. A movie, crafts, and stories! We can do all these and more during this event. Open to toilet-trained children 3-8 years old. Children are welcome to wear their pajamas. Availability is limited.
es: Obviamente a los niños les encantará divertirse mientras sus padres tienen una noche libre sin ellos. ¡Una película, arte y cuentos! Podemos hacer eso y mucho más durante este evento. Para niños de 3 a 8 años que ya saben usar el baño solos. Pueden venir en pijamas. El cupo es limitado.

source: One of the core beliefs at Nuestro Jardín is to build a community, bringing together students, parents, and teachers. Community Night is a time for all families to get together and get to know one another. It is also a time for parents and teachers to develop stronger partnerships and to discuss the latest teaching and parenting techniques used at Nuestro Jardín. After a family potluck, a parent meeting will follow.
es: Una de las convicciones fundamentales que tenemos en Nuestro Jardín es crear una comunidad, uniendo a los estudiantes, padres y maestros. La Noche de la Comunidad es un evento para que todas las familias se puedan reunir y conocerse (unas a las otras). También es una buena ocasión para que los padres, y maestros desarrollen alianzas más sólidas y relaciones de colaboración para discutir las técnicas más recientes utilizadas en Nuestro Jardín referentes a la enseñanza y crianza de los niños. Después de una cena al estilo ‘potluck’ (por contribución), se realizará una reunión para padres.

source: One week of paid sick/personal days
es: Una semana de licencia/días personales pagada

source: Open House on March 16th
es: Puertas Abiertas: 16 de marzo

source: Open House on Sunday, February 12th
es: Puertas Abiertas: 12 de febrero

source: Open until filled
es: Abierta hasta que se ocupen los puestos

source: Opening Summer of 2016!
es: ¡Gran Apertura: Verano 2016!

source: Our Curriculum
es: Nuestro Currículo

source: Our Program
es: Nuestro Programa

source: Our Vision of a <strong class="color-green">TRUE</strong> Spanish Immersion Program
es: Nuestra Visión de un <strong class="color-green">VERDADERO</strong> Programa de Inmersión en Español

source: Our bilingual teachers receive free and high-quality professional development in Spanish.
es: Nuestros maestros bilingües reciben capacitación profesional de un alto nivel de calidad, gratis y en español.

source: Our space is under construction, so five informal family-friendly open houses will be held at the home of the Director of Nuestro Jardín. Open houses start at 6pm and last for one hour. Join us to learn what Nuestro Jardín, Spanish Immersion Preschool is all about. Light refreshments will be served.
es: Debido a que nuestro edificio está en construcción, realizaremos cinco eventos informales de “Puertas Abiertas” para toda la familia que se realizarán en la residencia de la Directora de Nuestro Jardín. Los eventos de Puertas Abiertas comenzarán a las 6pm y tendrán una hora de duración. Los invitamos a acompañarnos y conocer más acerca de Nuestro Jardín, Spanish Immersion Preschool. Se servirán aperitivos ligeros.

source: Outside Play
es: Recreo (en el Parque)

source: PREFERRED QUALIFICATIONS (not required but a plus):
es: REQUISITOS DESEABLES (no necesarios, pero proveen una gran ventaja):

source: Part-Time: 20-30 hours per week
es: Medio Tiempo: 20-30 horas por semana

source: Participate in professional development activities and complete continuing education requirements.
es: Participar en actividades de desarrollo y capacitación profesional y completar requisitos de educación continua.

source: Playing is Learning Too
es: Jugando También se Aprende

source: Please note that a 6-9% tuition increase will be assessed each year
es: Por favor tome nota de que habrá un incremento anual en la matrícula de 6-9% al comienzo de cada año escolar.

source: Program
es: Programa

source: Program Participation and Team Member:
es: Participación y Trabajo en Equipo:

source: Project a professional work image
es: Proyectar una imagen profesional en el trabajo.

source: Provide and maintain a safe environment.
es: Proporcionar y mantener un ambiente de máxima seguridad.

source: Qualify under one of the following below:
es: Cumplir con una de las siguientes calificaciones:

source: RESPONSIBILITIES:
es: RESPONSABILIDADES:

source: Ready to publish your first post? <a href="%1$s">Get started here</a>.
es: ¿Listo para publicar tu primer artículo? <a href=\”%1$s\”>Comienza aquí</a>.

source: Register
es: Regístrese

source: Research has also shown that students in a 90:10 immersion program develop higher levels of bilingualism, biliteracy, and cognitive skills when compared with English-only proficient students participating in other educational programs. Another benefit of students being in a dual immersion program is that they will develop very positive attitudes about students of other language and cultural backgrounds, and positive attitudes toward themselves as learners. Consult the <a href="http://www.cal.org/twi/" target="_blank">Center for Applied Linguistics</a> for specific research studies.
es: Otros estudios también han demostrado que los estudiantes en programas de 90:10 desarrollan niveles de bilingüismo, bi-alfabetismo y habilidades cognitivas muchos más altos que los estudiantes anglo-parlantes que han estado en otros programas educacionales. Los estudiantes en programas de doble inmersión tienen aún un beneficio adicional: uno actitudinal. Estos alumnos desarrollan actitudes positivas hacia los estudiantes que hablan otros idiomas y tienen otros orígenes culturales y también fortalecen actitudes positivas hacia sí mismos como aprendices. Consulte la página de <a href="http://www.cal.org/twi/" target="_blank">Center for Applied Linguistics</a> para más información y estudios específicos.

source: Respect and maintain confidentiality of information regarding enrolled children and families, personnel issues, and other program operations as appropriate.
es: Respetar y mantener confidencialidad de toda información relacionada con los niños matriculados y sus familias, asuntos del personal y operaciones del programa como sea adecuado.

source: Responsible for the overall supervision, planning, and management of a Spanish immersion preschool class:
es: Responsable por la supervisión general, la planificación, y el manejo de la clase preescolar de inmersión al español:

source: Returning families - $90 annual materials fee due at the time of re-enrollment in March.
es: Familias que regresan - cargo para materiales de $90 que debe ser pagado al momento de las reinscripciones en marzo.

source: Run for part of June, July, and part of August.
es: Ofrecido durante parte de junio, en julio y parte de agosto

source: Salvador Dali
es: Salvador Dalí

source: Session 1: June 13-17 - El Regreso de los Dinosaurios (Return of the Dinosaurs)
es: Sesión 1: 13-17 junio - El Regreso de los Dinosaurios (Return of the Dinosaurs)

source: Session 2: June 20-24 - ¡Bichos, Bichos y más Bichos! (Bugs, Bugs, and more Bugs!)
es: Sesión 2: 20-24 junio - ¡Bichos, Bichos y más Bichos! (Bugs, Bugs, and more Bugs!)

source: Session 3: June 27- July 1 - Pintores españoles y latinoamericanos (Spanish and Latin American Painters
es: Sesión 3: 27 junio- 1 julio - Pintores españoles y latinoamericanos (Spanish and Latin American Painters

source: Session 4: July 5-8 (No camp July 4th) - ¡Ciencia Loca! (Mad Science!)
es: Sesión 4: 5-8 julio (cerrado el 4 de julio) - ¡Ciencia Loca! (Mad Science!)

source: Session 5: July 11-15 - Música y Bailes de Latinoamérica: Explorando la Percusión y el Ritmo Latino (Music and Dances from Latin America: Exploring Percussion and Latin Rhythm)
es: Sesión 5: 11-15 julio - Música y Bailes de Latinoamérica: Explorando la Percusión y el Ritmo Latino (Music and Dances from Latin America: Exploring Percussion and Latin Rhythm)

source: Session 6: July 18-22 - Inventores, Creadores y Constructores (Inventors, Creators, and Builders)
es: Sesión 6: 18-22 julio - Inventores, Creadores y Constructores (Inventors, Creators, and Builders)

source: Session 7: July 25-29 - ¡Juguemos en el Bosque! (Let's Play in the Woods!)
es: Sesión 7: 25-29 julio - ¡Juguemos en el Bosque! (Let's Play in the Woods!)

source: Session 8: August 1-5 - Cocina y Sabores Latinos (Latin Cooking and Flavors)
es: Sesión 8: 1-5 agosto - Cocina y Sabores Latinos (Latin Cooking and Flavors)

source: Sessions:
es: Sesiónes

source: She received a BA degree in Linguistics with a minor in Spanish and a TESOL (teaching English to Speakers of Other Languages) Certificate from San Jose State University. Later, she obtained her Teaching Credential from The National Hispanic University. Once in Oregon, she received a Master’s Degree in TESOL from Portland State University and also obtained her Oregon Teaching License.
es: Egresó de San Jose State University, California con el grado de BA en Lingüística con mención en español y también obtuvo su certificado de TESOL para enseñar inglés como segundo idioma. Un tiempo después, recibió el título y credencial de Enseñanza Primaria y Bilingüe de National Hispanic University para enseñar kinder a 5º grado. Ya instalada en Oregon, obtuvo su Master’s en Portland State University en TESOL y recibió su licencia para enseñar español, inglés como segundo idioma, y para trabajar en programas bilingües en Oregon.

source: Sibling Discount:
es: Descuento de Hermano:

source: Skills, expertise, or aptitude in:
es: Habilidad, especialización, o aptitud en:

source: Snack
es: Merienda

source: Snacks:
es: Meriendas:

source: Spanish Guitar
es: guitarra española

source: Spanish is More Than Just a Language
es: El español es más que un idioma

source: Spanish is more than just a language
es: El español es más que un idioma

source: Special Discount for signing up for 4 weeks or more:
es: Descuento Especial por inscribirse para 4 campamentos o más:

source: Spring Festival (April)
es: Festival de la Primavera (abril)

source: Standards set the basis for what children should know and be able to do based on their age and developmental level. Nuestro Jardín’s standards have been carefully created and are backed by solid research in early childhood and second language learning. Our curriculum was created to develop the whole child and allow teachers to collaborate and teach to a common goal. Our thematic approach adopts a monthly theme that is culturally relevant and personally emerges from students to enrich Nuestro Jardín Academy’s curriculum.
es: Los estándares educativos sientan las bases de lo que el niño debe saber y saber hacer en cada área y nivel de acuerdo a su edad y nivel de desarrollo. Los estándares de Nuestro Jardín han sido cuidadosamente diseñados y son respaldados por investigaciones sólidas en las áreas de la primera infancia y del aprendizaje y adquisición de una segunda lengua. Nuestro currículo balanceado, basado en estándares educativos ha sido diseñado para educar al niño en su totalidad y permitirle a los maestros colaborar y enseñar teniendo un objetivo en común. En nuestro planteamiento temático, adoptamos un tema mensual que sea culturalmente relevante y que surja de los estudiantes para así aún más enriquecer nuestro currículo.

source: Summer Camp Fees:
es: Cuotas:

source: Summer Camps_2016.pdf
es: Summer Camps_Sp_2016.pdf

source: Summer Festival (End of Year Celebration- June)
es: Festival del Verano (Celebración de Fin de Año- junio)

source: Summer camp sessions:
es: Sesiones de Campamentos de Verano:

source: Teacher planning built into schedule
es: La planificación está contemplada en el horario semanal de trabajo.

source: Teachers focus on children’s Spanish production to ensure students make actual progress in the <a href="http://www.colorincolorado.org/article/language-acquisition-overview" target="_blank">stages of second language acquisition</a> from the pre-production stage or “silent period” to early production and then to becoming speech emergent.
es: Nuestros maestros se enfocan en la producción del español de los niños para asegurarse de que estén realmente progresando en las <a href="http://www.colorincolorado.org/article/language-acquisition-overview" target="_blank">etapas de la adquisición de un segundo idioma</a> desde la etapa de preproducción o “básica”, a la de producción temprana, hasta el surgimiento del lenguaje.

source: Thank you for your interest in Nuestro Jardín Academy, Spanish Immersion Preschool! We are excited to be accepting applications now for the 2017-2018 school year starting this fall.
es: ¡Gracias por su interés en Nuestro Jardín Academy, Spanish Immersion Preschool! En este momento, estamos aceptando solicitudes para el año escolar 2017-2018 que comienza en el otoño.

source: The 90:10 immersion model used at Nuestro Jardín immerses the student in Spanish 90% of the day. Extensive research has demonstrated that ... <span class="more-link">(more)</span>
es: En el modelo de inmersión 90:10 que usamos en Nuestro Jardín, los estudiantes están en contacto directo con el español 90% del día escolar. En extensas investigaciones, se ha demostrado de que ... <span class="more-link">(mas)</span>

source: The 90:10 immersion model used at Nuestro Jardín immerses the student in Spanish 90% of the day. Extensive research has demonstrated that students who go through a 90:10 program consistently develop high levels of comprehension and reading and writing proficiency in their second language. They also display confidence when using it.
es: En el modelo de inmersión 90:10 que usamos en Nuestro Jardín, los estudiantes están en contacto directo con el español 90% del día escolar. En extensas investigaciones, se ha demostrado de que los estudiantes que han egresado de programas de inmersión 90:10 han desarrollado altos niveles de comprensión del lenguaje y habilidades en la lectura y escritura en su segundo idioma consistentemente. Ellos también demuestran mucha confianza en sí mismos al usar su segundo idioma.

source: The Gift of a Second Language
es: El Regalo de un Segundo Idioma
