Repository: nuestrojardinacademy/nuestrojardinacademy.github.io
Catalog: _i18n/*/*.po
Languages: es

source: The Guelaguetza, or Los lunes del cerro (Mondays on the Hill) is an annual indigenous cultural event in Mexico that takes place in the city of Oaxaca, capital of the state of Oaxaca, as well as in nearby villages. The celebration centers on traditional dancing in costume in groups, often gender-separated groups, as is traditional, and includes parades complete with indigenous walking bands, native food, and statewide artisanal crafts such as prehispanic-style textiles. Each costume (traje) and dance usually has a local indigenous historical and cultural meaning. Although the celebration is now an important tourist attraction, it also retains deep cultural importance for the peoples of the state and is important for the continuing survival of these cultures.
es: La Guelaguetza es una celebración que tiene lugar en la ciudad de Oaxaca de Juárez. La Guelaguetza forma parte de los cultos populares a la Virgen del Carmen, razón por la que se celebra los dos lunes más cercanos a la festividad católica de esta advocación Mariana (el 16 de julio). Otro nombre con que se conoce la Guelaguetza es el de “Los lunes del Cerro”, puesto que el corazón de la festividad es el cerro del Fortín, que domina el centro de la ciudad de Oaxaca. La palabra “guelaguetza” deriva del zapoteco guendalizaá, que significa “cooperar”, pero en su concepción más amplia es una actitud, una cualidad con la que se nace, un sentimiento por medio del cual el zapoteca ama a su prójimo, un sentimiento de hermandad, de compartir la naturaleza y la vida. En esta celebración participan grupos folclóricos de las ocho regiones del estado: La Costa, Cañada, Tuxtepec, Mixteca, Sierra Sur, Sierra Norte, Valles Centrales e Istmo.

source: The following are also required for employment and must be obtained within 90 days after accepting the position.
es: Cumplir también con los siguientes requisitos, los cuales pueden ser obtenidos dentro de 90 días después de haber aceptado empleo.

source: The whole child approach taken by Nuestro Jardín Academy ensures that each student is healthy, safe, engaged, supported, and challenged by ... <span class="more-link">(more)</span>
es: En Nuestro Jardín Academy nos enfocamos en educar al niño en su totalidad y en satisfacer las necesidades de afecto, cuidado, bienestar y desarrollo integral, además de desafiar al niño mediante ... <span class="more-link">(mas)</span>

source: The whole child approach taken by Nuestro Jardín Academy ensures that each student is healthy, safe, engaged, supported, and challenged by addressing students' needs through the shared responsibility of students, families, and the community.
es: En Nuestro Jardín Academy nos enfocamos en educar al niño en su totalidad y en satisfacer las necesidades de afecto, cuidado, bienestar y desarrollo integral, además de desafiar al niño mediante acciones pedagógicas integradoras y lúdicas cimentadas en los valores fundamentales de la vida humana y a través de la corresponsabilidad entre estudiantes, familias y comunidad.

source: This is the time for all moms at Nuestro Jardín to get out and get some ‘me time’ with other moms. At the beginning of each school year, the group will decide on the events for each month (dinner, movie, dancing, working out, book club, etc.)
es: Esta es una ocasión para que todas las mamás de Nuestro Jardín puedan tener tiempo para ellas mismas y con otras madres. Al comienzo de cada año escolar, el grupo decidirá en los eventos a realizar cada mes (cena, película, ir a bailar, hacer ejercicio, club de lectura, etc.)

source: Thursday, February 25th
es: Jueves, 25 de febrero

source: Thursday, February 4th
es: Jueves, 4 de febrero

source: To RSVP and get directions to the Director’s home, please send us an email (<a href="mailto:nja.contact@gmail.com?subject=Open House">nja.contact@gmail.com</a>). Please write “Open House” on the subject line and include your name and a phone number you can be contacted at. Hope to see you there!
es: Para confirmar su asistencia y obtener la dirección de la residencia de la Directora, por favor enviar un mensaje por correo electrónico a (<a href="mailto:nja.contact@gmail.com?subject=Puertas Abiertas">nja.contact@gmail.com</a>). Por favor escriba “Puertas Abiertas” en la línea de asunto e incluya su nombre y número de teléfono al que se le pueda contactar. ¡Esperamos verlos ahí!

source: Training:
es: Capacitación:

source: Transition
es: Transición

source: Transition to Nap/Quiet Time
es: Transición para la Siesta/Descanso

source: Transition to Same-Age Groups
es: Transición a Grupos de la Misma Edad

source: Tuesday, February 16th
es: Martes, 16 de febrero

source: Tuesday, March 8th
es: Martes, 8 de marzo

source: Tuition discount for any children attending Nuestro Jardín Academy
es: Descuento en la colegiatura para los hijos que estén matriculados en Nuestro Jardín Academy

source: Tuition is due on the first of each month starting in September 2017.
es: La colegiatura anual se divide en 10 pagos iguales desde septiembre hasta junio. Los siguientes aranceles entran en vigencia el 1º de septiembre del 2017, la que deberá pagarse el primer día de cada mes.

source: Two weeks paid vacation during Winter and Spring breaks
es: Dos semanas de vacaciones pagadas durante las vacaciones de invierno y de primavera

source: Valid Oregon Driver’s License
es: Licencia de conducir válida de Oregón

source: Visual and Performing Arts - Whole Group and Free Choice/Play
es: Artes Visuales y Escénicas- Instrucción al Grupo Entero y Libre Elección/Juego

source: WAIT LIST – How it works:
es: LISTA DE ESPERA – Cómo Funciona

source: We also help children understand who they are in the context of their race, ethnic group, culture, language and familial history. Through dramatic and role-play activities, students are encouraged to express themselves within the context of their identity.
es: También ayudamos a los niños a entender quiénes son en el contexto de su raza, grupo étnico, cultura, procedencia y ascendencia. Mediante el teatro y actividades de representación, los estudiantes pueden expresarse a sí mismos, entender su medio ambiente y ganar confianza en cuanto a su capacidad como individuo y su concepto de autoestima.

source: We do not charge a fee for families to get in our wait list. Interested families just need to fill out a wait list application. Your child’s place is determined by the date we receive your wait list form. However, siblings of children currently enrolled or who have been enrolled in our school in the past are given priority. Families are notified via phone and email when a space is available for their child. Parents will have 48 hours to notify us of their decision, complete the enrollment forms, and pay the deposit and fees. We will regularly assess openings available and use the wait list to inform families when availability exists.
es: No le cobramos a las familias por apuntarse en nuestra lista de espera. Toda familia que esté interesada, sólo necesita llenar una solicitud. La ubicación de su hijo o hija en la lista de espera es determinado por la fecha en que recibimos su formulario de solicitud. Sin embargo, los hermanos de los estudiantes que estén actualmente matriculados o hayan sido alumnos de nuestra escuela, tendrán prioridad de ingreso. Se les notificará a cada familia por teléfono y por correo electrónico cuando haya vacante disponible para su hijo o hija. Los padres tendrán 48 horas para notificarnos de su decisión, completar todos los formularios de inscripción y pagar el depósito y los cargos. Evaluaremos periódicamente las vacantes y utilizaremos la lista de espera para informarles a las familias cuando haya disponibilidad.

source: We promise a fun-filled summer camp adventure for children 3 to 7 years old while learning Spanish. Offered for 8 weeks throughout the summer months, we will be offering weekly camps that will have your children singing and dancing, playing, doing arts and crafts, cooking, exploring, and learning about Latin American and Spanish cultures while learning Spanish. No prior Spanish experience required.
es: Prometemos una aventura de campamento con mucha diversión para niños de 3 a 7 años mientras aprenden español. Por 8 semanas, durante los meses de verano, estaremos ofreciendo campamentos semanales que tendrán a sus hijos cantando y bailando, jugando, haciendo artes y manualidades, cocinando, explorando y aprendiendo de las culturas de Latinoamérica y España, a la misma vez que aprenden español. No se requiere experiencia previa con el español.

source: We provide two healthy natural or organic snacks to children daily.
es: Nosotros proporcionamos dos meriendas naturales u orgánicos diariamente.

source: We see children as unique individuals who come with unique strengths and needs. We embrace this diversity and will tap into what children have to offer. We will immerse ourselves in their world of wonderment while they are immersed in the world of language learning, and together we’ll travel the path of discovery, learning, and excitement!
es: Vemos al niño como un individuo único, con cualidades, virtudes y con diversas necesidades. Acogemos esta diversidad y aprovechamos este potencial y lo que cada niño pueda aportar. Nos sumergiremos en su mundo de fascinación mientras ellos se sumergen en el mundo de aprender significativamente otro idioma.

source: We serve toilet trained children who are 3 to 5 years of age. If you are interested in our program, we suggest you consider getting on our wait list. Families will be informed about enrollment at the end of March.
es: Nuestra escuela, acepta a niños que han sido entrenados para ir al baño desde los 3 hasta los 5 años de edad. Si está interesado en nuestro programa, le sugerimos que considere inscribirse en nuestra lista de espera. A fines de marzo, se les informará a las familias de las matrículas para el próximo año escolar. Las inscripciones para el programa de verano comenzarán en marzo.

source: We take pride in our diverse community and we encourage our families to share their culture and heritage in the classroom.
es: Nos enorgullecemos de nuestra comunidad diversa y animamos a nuestras familias a compartir sus culturas y tradiciones en el salón de clases.

source: Wednesday, March 16th
es: Miércoles, 16 de marzo

source: Welcome to <span class="nja-green">Nuestro</span> Jardín
es: Bienvenido a <span class="nja-green">Nuestro</span> Jardín

source: Welcome- Free Choice - Mixed-Age Groups
es: Bienvenidos- Libre Elección- Grupos de Edades Mixtas

source: Winter Festival (December)
es: Festival del Invierno (diciembre)

source: With these theories and students’ learning styles in mind, the teachers at Nuestro Jardín use diverse teaching methodologies, integrating direct, inquiry-based instruction, and cooperative learning into everyday lessons. In addition, all activities throughout the day are geared to our diverse learners, and we make sure that all students’ learning styles are met (<a href="http://www.tecweb.org/styles/gardner.html">http://www.tecweb.org/styles/gardner.html</a>).
es: Considerando estas teorías, los maestros de Nuestro Jardín utilizan una diversidad de metodologías de aprendizaje mediante acciones pedagógicas integradoras como instrucción directa e indirecta, instrucción interactiva, independiente y experimental y el aprendizaje cooperativo. Además, cada actividad realizada durante el día está orientada a satisfacer las necesidades de nuestros estudiantes diversificados. (<a href="http://www.tecweb.org/styles/gardner.html">http://www.tecweb.org/styles/gardner.html</a>).

source: You may choose up to 8 camps for full, half day, or a combination of both throughout the summer.
es: Puede elegir hasta 8 campamentos de jornada completa, media jornada combinación de ambas durante el verano.

source: days
es: días

source: second language teaching
es: enseñanza de un segundo idioma

source: the performing arts (dance, music, drama)
es: las artes escénicas (danza, música, teatro)

source: the visual arts
es: las artes visuales
